{
  "questions": [
    "How does sp_SpaceRecommend determine the acceptable price range for a user's preferred budget?",
    "What temporary table is created in sp_RangeBook and what is its purpose?",
    "Describe the WHILE loop logic implemented in sp_RangeBook.",
    "How does sp_PopularDay use the inner query alias t to compute daily statistics?",
    "Which SQL function is used to convert the numeric month to its name in sp_MonthlyRevenue?",
    "What parameters are required by sp_PopularDay and how do they affect the result set?",
    "Explain how sp_MostSpender calculates the 'Days On Platform' metric.",
    "How are null booking counts handled in the recommendation ordering of sp_SpaceRecommend?",
    "What conditions cause sp_PayCharge to set the payment status to 'completed'?",
    "In sp_BookSpace, how is the variable 'price' updated for bookings that exceed one day?",
    "Explain the use of ENUM values in sp_PopularDay for filtering booking status.",
    "What is the significance of the 'NumUsers' parameter in sp_MostSpender?",
    "How does sp_RangeBook label each price range in the definedRange column?",
    "Describe how sp_SpaceRecommend excludes fully booked spaces from its results.",
    "What join is used in sp_MonthlyRevenue and why is it necessary?",
    "How does sp_PopularDay calculate the total platform fee for each day?",
    "Explain the purpose of the CAST operation in sp_SpaceRecommend when calculating bookedHours.",
    "Why does sp_MostSpender divide by TIMESTAMPDIFF when computing average spending?",
    "Describe the logic behind updating the variable 'sts' in sp_PayCharge.",
    "What triggers a ROLLBACK in editBookingCustomer?",
    "How does sp_BookSpace determine the total booking duration using TIMESTAMPDIFF?",
    "Explain the role of START TRANSACTION in editBookingCustomer.",
    "What is the difference between hourlyRate, halfdayRate, and fulldayRate in determining price in sp_BookSpace?",
    "How does sp_RangeBook ensure that hourly rates are grouped into equal steps?",
    "Describe how sp_PopularDay filters out bookings that are not completed or booked.",
    "Which table relationship is leveraged in sp_MostSpender to link payments to users?",
    "How does sp_MonthlyRevenue aggregate spacePrice and sysFee to compute total revenue?",
    "Explain how the LIMIT clause is used in sp_SpaceRecommend to cap results.",
    "What is the purpose of the DROP PROCEDURE IF EXISTS statement in the SQL files?",
    "How does sp_RangeBook use BETWEEN to classify hourly rates?",
    "Describe the ordering logic in sp_MostSpender for selecting top spenders.",
    "What data type is used for the rating parameter in sp_UserRegistration and why?",
    "How does sp_BookSpace insert timestamps for createdAt and updatedAt?",
    "Explain the use of LEFT JOIN in sp_SpaceRecommend.",
    "How does sp_PopularDay compute day names from endTime values?",
    "What role does the variable prePrice play in sp_SpaceRecommend?",
    "Describe how sp_MonthlyRevenue filters bookings based on status.",
    "Explain how ENUM types enhance data integrity in booking status fields.",
    "How does sp_PayCharge calculate unpaid amount after a payment?",
    "What safeguards prevent duplicate user rows in sp_UserRegistration?",
    "Describe how sp_RangeBook aggregates booking data for each defined range.",
    "How does sp_MostSpender utilize the LIMIT clause to restrict output size?",
    "Explain how the temporary table spacetem is dropped in sp_RangeBook.",
    "What conditions determine the booking status update in sp_BookSpace?",
    "How does sp_PopularDay join the rent table to booking records?",
    "Describe the calculation of sysFee in the booking context.",
    "How does the procedure GetOwnerFeedback fetch feedback details?",
    "What are the advantages of using stored procedures for payment processing?",
    "How does sp_MonthlyRevenue group results by both Month and Year?",
    "Explain the difference between INNER JOIN and LEFT JOIN as used across these procedures."
  ]
}
